/* Program    : LEARNCL02                                                    */
/* Author     : Rohit Sharma                                                 */
/* Created on : 2026-03-19                                                   */
/* Modified on: 2026-04-01                                                   */
/* %TEXT: Pass a parm to LEARNCL01                                           */
/* Usage      : CALL LEARNCL02 PARM(NAME)                                    */

START:      PGM PARM(&NAME)

            DCL &NAME *CHAR LEN(10)
            DCL &MSG *CHAR LEN(80)

        /* Check parameter count before touching parm storage */
            IF COND(%PARMS *LT 1) THEN(DO)
                CHGVAR &MSG VALUE('Input parm is required.')
                SNDPGMMSG MSGDTA(&MSG) MSGID(CPF9898) MSGF(QCPFMSG) MSGTYPE(*ESCAPE)
            ENDDO

        /* Call LEARNCL01 with the parm */
            CALL PGM(LEARNCL01) PARM(&NAME)
            
EOP:        ENDPGM

